# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "lazygit"
brew "lazysql"
brew "awscli"
brew "jq"
brew "yq"
brew "gh"
brew "delta"
brew "tmux"
brew "stow"
brew "neovim"
brew "eza"
# brew "kubectl"   # Kubernetes CLI
# brew "glab"      # GitLab CLI

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# Languages stuff
cask "mise"

# GUI Applications
cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "ghostty"
cask "discord"
cask "shottr"

# I don't want these by default
# cask "raycast"
# cask "caffeine"

# Fonts
cask "font-jetbrains-mono-nerd-font"